var locations=
    [
        {
          name: "淡路島hello kitty smile",
          jp_name: "(あわじしま ハローキティスマイル)",
          latlng: [34.5672, 134.9524],
          photo: "景點/淡路島hello kitty smile.jpg",
          option: ""
        },
        {
          name: "明石海峡大橋",
          jp_name: "(あかしかいきょうおおはし)",
          latlng: [34.6176, 135.0216],
          photo: "景點/明石海峡大橋.jpg",
          option: ""
        },
        {
          name: "平安神宮",
          jp_name: "(へいあんじんぐう)",
          latlng: [35.0161, 135.7824],
          photo: "景點/平安神宮.jpg",
          option: ""
        },
        {
          name: "下鴨神社",
          jp_name: "(しもがもじんじゃ)",
          latlng: [35.0391, 135.7729],
          photo: "景點/下鴨神社.jpg",
          option: ""
        },
        {
          name: "河合神社",
          jp_name: "(かわいじんじゃ)",
          latlng: [35.03495053528841, 135.77194609991912],
          photo: "景點/河合神社.jpg",
          option: ""
        },
        {
          name: "琵琶湖觀景台",
          jp_name: "(びわこテラス)",
          latlng: [35.22003450215982, 135.89380405967754],
          photo: "景點/琵琶湖觀景台.jpg",
          option: ""
        },
        {
          name: "南禪寺",
          jp_name: "(なんぜんじ)",
          latlng: [35.011585712043264, 135.79446698619222],
          photo: "景點/南禪寺.jpg",
          option: ""
        },
        {
          name: "六角堂",
          jp_name: "(ちょうほうじ)",
          latlng: [35.014180705719745, 135.7595696519305],
          photo: "景點/六角堂.jpg",
          option: ""
        },
        {
          name: "錦天滿宮",
          jp_name: "(にしきてんまんぐう)",
          latlng: [35.00514416801074, 135.76726611340865],
          photo: "景點/錦天滿宮.jpg",
          option: ""
        },
        {
          name: "錦市場",
          jp_name: "(にしきいちば)",
          latlng: [35.006687919384156, 135.76460981437376],
          photo: "景點/錦市場.jpg",
          option: ""
        },
        {
          name: "姬路城",
          jp_name: "(ひめじじょう)",
          latlng: [34.839651532165206, 134.69390469991916],
          photo: "景點/姬路城.jpg",
          option: "由於白色外牆也被稱作「白鷺城」，為日本三大名城之一。1993年成為日本首個世界遺產，有「日本第一名城」美名。"
        },
        {
          name: "京都御苑",
          jp_name: "(きょうとぎょえん)",
          latlng: [35.02334382590117, 135.76346696915297],
          photo: "景點/京都御苑.jpg",
          option: ""
        },
        {
          name: "二條城",
          jp_name: "(にじょうじょう)",
          latlng: [35.01441987784439, 135.74821753543372],
          photo: "景點/二條城.jpg",
          option: ""
        },
        {
          name: "晴明神社",
          jp_name: "(せいめいじんじゃ)",
          latlng: [35.0279181400215, 135.7511694710835],
          photo: "景點/晴明神社.jpg",
          option: ""
        },
        {
          name: "御金神社",
          jp_name: "(みかねじんじゃ)",
          latlng: [35.01199604583906, 135.75500445869716],
          photo: "景點/御金神社.jpg",
          option: ""
        },
        {
          name: "大阪梅田藍天大樓",
          jp_name: "(うめだスカイビル)",
          latlng: [34.70535273346036, 135.4896456875148],
          photo: "景點/大阪梅田藍天大樓.jpg",
          option: ""
        },
        {
          name: "通天閣",
          jp_name: "(つうてんか)",
          latlng: [34.6526492098591, 135.50628433910666],
          photo: "景點/通天閣.jpg",
          option: ""
        },
        {
          name: "京都塔",
          jp_name: "(きょうと タワー)",
          latlng: [34.98763474128788, 135.75921961028192],
          photo: "景點/京都塔.jpg",
          option: ""
        },
        {
            name: "平等院",
            jp_name: "(びょうどういん)",
            latlng: [34.88944040703848, 135.80764611341215],
            photo: "景點/平等院.jpg",
            option: "鳳凰堂的建筑印在日圆十元硬币上，这座日本早期木构建筑，被认为是古代日本人对于西方极乐世界的极致具体实现。"
          },
          {
            name: "清水寺",
            jp_name: "(きよみずでら)",
            latlng: [34.995040643719115, 135.7850141102821],
            photo: "景點/清水寺.jpg",
            option: ""
          },
          {
            name: "貴船神社",
            jp_name: "(きぶねじんじゃ)",
            latlng: [35.131811498682666, 135.76014231289605],
            photo: "景點/貴船神社.jpg",
            option: ""
          },
          {
            name: "八坂神社",
            jp_name: "(やさかじんじゃ )",
            latlng: [35.01732432872339, 135.7774084675863],
            photo: "景點/八坂神社.jpg",
            option: ""
          },
          {
            name: "道頓崛",
            jp_name: "(どうとんぼり)",
            latlng: [34.669008836459014, 135.503105034773],
            photo: "景點/道頓崛.jpg",
            option: ""
          },
          {
            name: "黑門市場",
            jp_name: "(くろもんいちば)",
            latlng: [34.66553908387263, 135.50618378143676],
            photo: "景點/黑門市場.jpg",
            option: ""
          },
          {
            name: "心齋橋",
            jp_name: "(しんさいばし)",
            latlng: [34.67113219842464, 135.501249713493],
            photo: "景點/心齋橋.jpg",
            option: ""
          },
          {
            name: "臨空城",
            jp_name: "(りんくうタウン)",
            latlng: [34.40649489907472, 135.29542375442574],
            photo: "景點/臨空城.jpg",
            option: ""
          },
          {
            name: "甲子園",
            jp_name: "(こうしえん)",
            latlng: [34.72147218234499, 135.36161987453121],
            photo: "景點/甲子園.jpg",
            option: ""
          },
          
         {
              name: "大阪城",
              jp_name: "(おおさかじょう)",
              latlng: [34.6873, 135.5258],
              photo: "景點/大阪城.jpg",
              option: ""
            },
            {
              name: "大通公園",
              jp_name: "(おおどおりこうえん)",
              latlng: [35.1991, 136.8447],
              photo: "景點/大通公園.jpg",
              option: ""
            },
            {
              name: "小樽運河",
              jp_name: "(おたるうんが)",
              latlng: [43.2022, 141.0006],
              photo: "景點/小樽運河.jpg",
              option: ""
            },
            {
              name: "日光東照宮",
              jp_name: "(にっこうとうしょうぐう)",
              latlng: [36.7578, 139.5993],
              photo: "景點/日光東照宮.jpg",
              option: ""
            },
            {
              name: "白色戀人觀光工廠",
              jp_name: "(しろいこいびとパーク)",
              latlng: [43.0889, 141.2717],
              photo: "景點/白色戀人觀光工廠.jpg",
              option: ""
            },
            {
              name: "白鬚瀑布",
              jp_name: "(しらひげのたき)",
              latlng: [43.4746, 142.6393],
              photo: "景點/白鬚瀑布.jpg",
              option: "位於海拔600公尺高的山上、北海道大雪山國立公園內，瀑布高度落差30公尺，因白鬚瀑布湧出的是溫泉水，所以即使是冬天也不會結凍！"
            },
            {
              name: "伏見稻荷大社",
              jp_name: "(ふしみいなりたいしゃ)",
              latlng: [34.9671, 135.7727],
              photo: "景點/伏見稻荷大社.jpg",
              option: "提到「朱紅色鳥居」，千本鳥居(Senbon Torii)，人們馬上就會聯想到「稻荷神社」，赤紅的色彩已深植人心。而紅色亦承載著對於擁有生命、大地、生產力量的稻荷大神「御靈」功績的強烈信仰。"
            },
            {
              name: "明治神宮",
              jp_name: "(めいじじんぐう)",
              latlng: [35.6764, 139.6993],
              photo: "景點/明治神宮.jpg",
              option: ""
            },
            {
              name: "東京鐵塔",
              jp_name: "(とうきょうタワ)",
              latlng: [35.6586, 139.7454],
              photo: "景點/東京鐵塔.jpg",
              option: ""
            },
            {
              name: "金閣寺",
              jp_name: "(きんかくじ)",
              latlng: [35.0393, 135.7292],
              photo: "景點/金閣寺.jpg",
              option: "原名「鹿苑寺」的寺院因為外觀貼滿金箔，所以又有個響亮的別稱「金閣寺」，其中最為漂亮的景為金閣寺與湖中金閣寺的倒影。"
            },
            {
              name: "祇園祭",
              jp_name: "(ぎおんまつり)",
              latlng: [35.0041, 135.7581],
              photo: "景點/祇園祭.jpg",
              option: ""
            },
            {
              name: "淺草寺",
              jp_name: "(せんそうじ)",
              latlng: [35.7147, 139.7966],
              photo: "淺草寺.jpg",
              option: ""
            },
            {
              name: "富士山河口湖",
              jp_name: "(ふじさん かわぐちこ)",
              latlng: [35.4925, 138.6847],
              photo: "景點/富士山河口湖.jpg",
              option: "河口湖位於日本山梨縣、東京西邊，是可以完整欣賞到富士山美景、屬於日本富士五湖之一，知名度最高的湖泊。"
            },
            {
              name: "晴空塔",
              jp_name: "(とうきょうスカイツリ)",
              latlng: [35.71, 139.81],
              photo: "景點/晴空塔.jpg",
              option: ""
            },
          
          
        ]
        
      
